In [41]:
%matplotlib inline
import pandas as pd

# Print all outputs in jupyter notebook
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
titles = pd.read_csv('pycon-pandas-tutorial/data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2   The Spider and the Fly  1949
3                  Country  2000
4          The Golden Note  2017

In [3]:
cast = pd.read_csv('pycon-pandas-tutorial/data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [4]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [5]:
titles.sort_values('year').head(2)

                     title  year
187327          Miss Jerry  1894
226857  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:
len(titles[titles.title=="Hamlet"])

20

### How many movies are titled "North by Northwest"?

In [7]:
len(titles[titles.title=="North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [8]:
t=titles
t[t.title=="Hamlet"].sort_values('year').head(1)

        title  year
49308  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [9]:
t[t.title=="Treasure Island"].sort_values('year')

                  title  year
217091  Treasure Island  1918
54095   Treasure Island  1920
201357  Treasure Island  1934
102046  Treasure Island  1950
81338   Treasure Island  1972
117328  Treasure Island  1973
216419  Treasure Island  1985
189010  Treasure Island  1999

### How many movies were made in the year 1950?

In [10]:
len(t[t.year==1950])

1113

### How many movies were made in the year 1960?

In [11]:
len(t[t.year==1960])

1549

### How many movies were made from 1950 through 1959?

In [12]:
len(t[(t.year>=1950) & (t.year<=1959)])

12934

### In what years has a movie titled "Batman" been released?

In [13]:
t[t.title=="Batman"]

        title  year
59052  Batman  1989
78565  Batman  1943

### How many roles were there in the movie "Inception"?

In [14]:
c=cast
len(c[c.title=="Inception"])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [15]:
c.head()
len(c[(c.title=="Inception") & (c.n.isnull())])

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [16]:
len(c[(c.title=="Inception") & (c.n.notnull())])

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [17]:
c[(c.title=="North by Northwest") & (c.n.notnull())].sort_values('n')

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [18]:
c[(c.title=="Sleuth")&(c.year==1972)].sort_values('n')

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [19]:
c[(c.title=="Sleuth")&(c.year==2007)].sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [20]:
len(c[(c.title=="Hamlet")&(c.year==1921)])

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [21]:
len(c[(c.title=="Hamlet")&(c.year==1996)])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [22]:
c=cast
c=c[c.character=="Hamlet"]
len(c)

96

### How many people have played an "Ophelia"?

In [23]:
c=cast
c=c[c.character=="Ophelia"].name.unique()
len(c)

115

### How many people have played a role called "The Dude"?

In [39]:
c=cast
c=c[c.character=="The Dude"].name.unique()
len(c)

19

### How many people have played a role called "The Stranger"?

In [36]:
c=cast
c=c[c.character=="The Stranger"].name.unique()
len(c)

202

### How many roles has Sidney Poitier played throughout his career?

In [33]:
c=cast
c.head()
c=c[c.name=="Sidney Poitier"]
len(c)

43

### How many roles has Judi Dench played?

In [47]:
c=cast
c=c[c.name=="Judi Dench"]
len(c)

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [56]:
c=cast
c=c[(c.name=="Cary Grant")&(c.year>=1940)&(c.year<1950)&(c.n==2)].sort_values('year')
c

,title,year,name,type,character,n
3786171,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3786172,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3786173,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0
3786174,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3786175,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [57]:
c=cast
c=c[(c.name=="Cary Grant")&(c.year>=1940)&(c.year<1950)&(c.n==1)].sort_values('year')
c

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [65]:
c=cast
c=c[(c.year//10==195)&(c.type=="actor")] # Instead of having two conditions to use year, basically doing mod10 by using "c.year//10"
c
len(c)

,title,year,name,type,character,n
66,Fire Down Below,1957,'Stretch' Cox Troupe,actor,Limbo Dance by,20.0
68,Dorp aan de rivier,1958,Frans 't Hoen,actor,Dirk Jan,15.0
111,Ci sposeremo a Capri,1956,Quartetto 2+2,actor,Themselves,19.0
119,Die Todesarena,1953,Die 3 Motorellos,actor,Themselves,NaN
288,Palletoori Pilla,1950,Subba Rao A.V.,actor,Kampanna Dora,4.0
...,...,...,...,...,...,...
2532460,Salve sauegjeter,1958,?yvind ?yen,actor,"Asbj?rn, sauegjeter",2.0
2532468,La noche avanza,1952,Francisco ?beda,actor,Pelotari,21.0
2532533,Yaban kiz,1954,Memduh ?n,actor,Mehmet,4.0
2532643,Barbaros Hayrettin Pasa,1951,Ali ?st?ntas,actor,Levend,NaN
2532644,Kara Efe,1952,Ali ?st?ntas,actor,Kara Efe,1.0

157738

157738

### How many roles were available for actresses in the 1950s?

In [68]:
c=cast
c=c[(c.year//10==195)&(c.type=="actress")]
len(c)

57733

In [71]:
c = cast
c = c[c.year // 10 == 195]
c = c[c.type == 'actress']
len(c) # Answer ok

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [69]:
c=cast
c=c[(c.year<=1980)&(c.n==1)]
len(c)

65140

In [72]:
c = cast
c = c[c.year <= 1980]
c = c[c.n == 1]
len(c) # Answer ok

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [74]:
c=cast
c=c[(c.year<=1980)&(c.n!=1)]
len(c)

1117667

In [75]:
c = cast
c = c[c.year <= 1980]
c = c[c.n != 1]
len(c) # Answer ok

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [76]:
c=cast
c=c[(c.year<=1980)&(c.n.isnull())]
len(c)

448347

In [77]:
c = cast
c = c[c.year <= 1980]
c = c[c.n.isnull()]
len(c) # Answer ok

448347